; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image5 - mode
	thermograph2 - mode
	thermograph1 - mode
	image4 - mode
	thermograph3 - mode
	thermograph0 - mode
	GroundStation8 - direction
	GroundStation2 - direction
	Star6 - direction
	Star7 - direction
	GroundStation3 - direction
	Star0 - direction
	GroundStation9 - direction
	GroundStation5 - direction
	Star1 - direction
	Star4 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 image4)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph3)
	(supports instrument1 image4)
	(calibration_target instrument1 Star6)
	(supports instrument2 thermograph3)
	(supports instrument2 image4)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph0)
	(supports instrument3 image4)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image5)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 image4)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite1 GroundStation5)
	(have_image Phenomenon10 image5)
	(have_image Planet11 thermograph0)
	(have_image Planet11 thermograph1)
	(have_image Star12 thermograph0)
	(have_image Planet13 thermograph1)
	(have_image Planet14 image5)
))

)

; plan
1. (turn_to satellite1 groundstation5 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation5)
   goals met: 1 of 7
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 7
3. (calibrate satellite1 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 1 of 7
4. (turn_to satellite1 planet14 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet14)
   goals met: 0 of 7
5. (take_image satellite1 planet14 instrument4 image5)
   added: (have_image planet14 image5)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon10 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon10 instrument4 image5)
   added: (have_image phenomenon10 image5)
   goals met: 2 of 7
8. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 2 of 7
9. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 7
10. (turn_to satellite1 groundstation3 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation3)
   goals met: 2 of 7
11. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 2 of 7
12. (turn_to satellite1 planet11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet11)
   goals met: 2 of 7
13. (take_image satellite1 planet11 instrument3 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 3 of 7
14. (take_image satellite1 planet11 instrument3 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 4 of 7
15. (turn_to satellite1 planet13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet13)
   goals met: 4 of 7
16. (take_image satellite1 planet13 instrument3 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 5 of 7
17. (turn_to satellite1 star12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star12)
   goals met: 5 of 7
18. (take_image satellite1 star12 instrument3 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 6 of 7
19. (turn_to satellite1 groundstation5 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation5)
   goals met: 7 of 7
